hun9pham/ak-sources-base/STM32L151C8T6/sources/application/sources/platform/mbport/mbportserial.c
/*
 * MODBUS Library: ARM STM32 Port (FWLIB 2.0x)
 * Copyright (c) Christian Walter <cwalter@embedded-solutions.at>
 * All rights reserved.
 *
 * ARM STM32 Port by Niels Andersen, Elcanic A/S <niels.andersen.elcanic@gmail.com>
 *
 * $Id: mbportserial.c,v 1.2 2008-12-14 20:30:27 cwalter Exp $
 */

/* ----------------------- System includes ----------------------------------*/
#include <stdlib.h>

/* ----------------------- Platform includes --------------------------------*/
#include "mbport.h"

/* ----------------------- csModbus includes ----------------------------------*/
#include "common/mbtypes.h"
#include "common/mbportlayer.h"
#include "common/mbframe.h"
#include "common/mbutils.h"

/* ------------------------ User includes -----------------------------------*/
#include "stm32xx_inc.h"
#include "io_cfg.h"
#include "sys_dbg.h"

/* ----------------------- Defines ------------------------------------------*/

#define IDX_INVALID				( 255 )
#define UART_BAUDRATE_MIN		( 300 )
#define UART_BAUDRATE_MAX		( 460800 )


#define UART_1_ENABLED          ( 0 )   /*!< Set this to 1 to enable USART1 */
#define UART_2_ENABLED          ( 1 )   /*!< Set this to 1 to enable USART2 */
#define UART_3_ENABLED          ( 0 )   /*!< Set this to 1 to enable USART3 */
#define UART_4_ENABLED          ( 0 )   /*!< Set this to 1 to enable USART4 */


/*----------------------------------------------------------------------------*
 *  DECLARE: UART User include
 *  Note: csModbus protocol
 *----------------------------------------------------------------------------*/
#if UART_1_ENABLED == 1
#define UART_1_PORT (MB_UART_1)
#endif

#if UART_2_ENABLED == 1
#define UART_2_PORT (MB_UART_2)
#endif

#if UART_3_ENABLED == 1
#define UART_3_PORT (MB_UART_3)
#endif

#if UART_4_ENABLED == 1
#define UART_4_PORT (MB_UART_4)
#endif

enum
{
#if UART_1_ENABLED == 1
	UART_1_IDX,
#endif
#if UART_2_ENABLED == 1
	UART_2_IDX,
#endif
#if UART_3_ENABLED == 1
	UART_3_IDX,
#endif
#if UART_4_ENABLED == 1
	UART_4_IDX,
#endif
	NUARTS
} eUartPort;
/*----------------------------------------------------------------------------*/

#define RS_485_UART_1_INIT(  )	\
do {\
    /* not implemented yet */\
} while( 0 )

#define RS_485_UART_1_ENABLE_TX(  )	\
do {\
    /* not implemented yet */\
} while( 0 )

#define RS_485_UART_1_DISABLE_TX(  ) \
do { \
    /* not implemented yet */ \
} while( 0 )
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
#define RS_485_UART_2_INIT(  )	            \
        do {                                \
            RS485_UartInit();           \
            RS485_DirectPinInit();  \
        } while( 0 )

#define RS_485_UART_2_ENABLE_TX(  )	            \
        do {                                    \
            setRS485DirectPin(1);  \
        } while( 0 )

#define RS_485_UART_2_DISABLE_TX(  )            \
        do {                                    \
            setRS485DirectPin(0);   \
        } while( 0 )
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
#define RS_485_UART_3_INIT(  )	            \
        do {                                \
            RS485_UartInit();           \
            RS485_DirectPinInit();  \
        } while( 0 )

#define RS_485_UART_3_ENABLE_TX(  )	            \
        do {                                    \
            setRS485DirectPin(1);  \
        } while( 0 )

#define RS_485_UART_3_DISABLE_TX(  )            \
        do {                                    \
            setRS485DirectPin(0);   \
        } while( 0 )
/*----------------------------------------------------------------------------*/

#define RS_485_UART_4_INIT(  )\
do { \
    /* not implemented yet */ \
} while( 0 )

#define RS_485_UART_4_ENABLE_TX(  )	\
do { \
    /* not implemented yet */ \
} while( 0 )

#define RS_485_UART_4_DISABLE_TX(  ) \
do { \
    /* not implemented yet */ \
} while( 0 )
/*----------------------------------------------------------------------------*/

/* ----------------------- Defines ------------------------------------------*/
/* ----------------------- Defines (Internal - Don't change) ----------------*/
#define HDL_RESET( x ) do { \
	( x )->ubIdx = IDX_INVALID; \
	( x )->pbMBMTransmitterEmptyFN = NULL; \
	( x )->pvMBMReceiveFN = NULL; \
	( x )->xMBMHdl = MB_HDL_INVALID; \
} while( 0 );

/* ----------------------- Type definitions ---------------------------------*/
typedef struct
{
    UBYTE           ubIdx;
    pbMBPSerialTransmitterEmptyAPIV1CB pbMBMTransmitterEmptyFN;
    pvMBPSerialReceiverAPIV1CB pvMBMReceiveFN;
    xMBHandle       xMBMHdl;
} xSerialHandle;

/* ----------------------- Static variables ---------------------------------*/
STATIC xSerialHandle xSerialHdls[NUARTS];
STATIC BOOL     bIsInitalized = FALSE;

/* ----------------------- Static functions ---------------------------------*/
#if UART_1_ENABLED == 1
void            vMBPUSART1ISR( void ) __attribute__ ( ( __interrupt__ ) );
STATIC void     prvvMBPUSART1_TXE_ISR( void );
STATIC void     prvvMBPUSART1_TC_ISR( void );
STATIC void     prvvMBPUSART1_RXNE_ISR( void );
#endif 

#if UART_2_ENABLED == 1
void            vMBPUSART2ISR( void ) __attribute__ ( ( __interrupt__ ) );
STATIC void     prvvMBPUSART2_TXE_ISR( void );
STATIC void     prvvMBPUSART2_TC_ISR( void );
STATIC void     prvvMBPUSART2_RXNE_ISR( void );
#endif 

#if UART_3_ENABLED == 1
void            vMBPUSART3ISR( void );
STATIC void     prvvMBPUSART3_TXE_ISR( void );
STATIC void     prvvMBPUSART3_TC_ISR( void );
STATIC void     prvvMBPUSART3_RXNE_ISR( void );
#endif 

#if UART_4_ENABLED == 1
void            vMBPUSART4ISR( void ) __attribute__ ( ( __interrupt__ ) );
STATIC void     prvvMBPUSART4_TXE_ISR( void );
STATIC void     prvvMBPUSART4_TC_ISR( void );
STATIC void     prvvMBPUSART4_RXNE_ISR( void );
#endif

/* ----------------------- Start implementation -----------------------------*/

eMBErrorCode
eMBPSerialInit( xMBPSerialHandle * pxSerialHdl, UCHAR ucPort, ULONG ulBaudRate,
                UCHAR ucDataBits, eMBSerialParity eParity, UCHAR ucStopBits, xMBHandle xMBMHdl )
{
    USART_ClockInitTypeDef USART_ClockInitStructure;
    USART_InitTypeDef USART_InitStructure;
    eMBErrorCode    eStatus = MB_ENOERR;
    UBYTE           ubIdx;

    MBP_ENTER_CRITICAL_SECTION(  );
    if( !bIsInitalized )
    {
        for( ubIdx = 0; ubIdx < MB_UTILS_NARRSIZE( xSerialHdls ); ubIdx++ )
        {
            HDL_RESET( &xSerialHdls[ubIdx] );
        }
#if UART_1_ENABLED == 1
        RS_485_UART_1_INIT(  );
        RS_485_UART_1_DISABLE_TX(  );
#endif
#if UART_2_ENABLED == 1
        RS_485_UART_2_INIT(  );
        RS_485_UART_2_DISABLE_TX(  );
#endif
#if UART_3_ENABLED == 1
        RS_485_UART_3_INIT(  );
        RS_485_UART_3_DISABLE_TX(  );
#endif
#if UART_4_ENABLED == 1
        RS_485_UART_4_INIT(  );
        RS_485_UART_4_DISABLE_TX(  );
#endif
        bIsInitalized = TRUE;
    }

    if( ( MB_HDL_INVALID == xMBMHdl ) || ( NULL == pxSerialHdl ) )
    {
        eStatus = MB_EINVAL;
    }
    else
    {
        eStatus = MB_ENORES;

        /* Setup baudrate */
        if( ( ulBaudRate > UART_BAUDRATE_MIN ) && ( ulBaudRate < UART_BAUDRATE_MAX ) )
        {
            USART_InitStructure.USART_BaudRate = ulBaudRate;
        }
        else
        {
            eStatus = MB_EINVAL;
        }

        /* Setup stopbits */
        switch ( ucStopBits )
        {
        case 1:
            USART_InitStructure.USART_StopBits = USART_StopBits_1;
            break;
        case 2:
            USART_InitStructure.USART_StopBits = USART_StopBits_2;
            break;
        default:
            eStatus = MB_EINVAL;
            break;
        }

        /* For STM32 parity is placed on bit 9 (MSB)
         * Select correct number of databits */
        if( ucDataBits == 8 )
        {
            if( eParity != MB_PAR_NONE )
            {
                USART_InitStructure.USART_WordLength = USART_WordLength_9b;
            }
            else
            {
                USART_InitStructure.USART_WordLength = USART_WordLength_8b;
            }
        }
        else
        {
            if( eParity != MB_PAR_NONE )
            {
                USART_InitStructure.USART_WordLength = USART_WordLength_8b;
            }
            else
            {
                eStatus = MB_EINVAL;
            }
        }

        /* Setup parity */
        switch ( eParity )
        {
        case MB_PAR_NONE:
            USART_InitStructure.USART_Parity = USART_Parity_No;
            break;
        case MB_PAR_ODD:
            USART_InitStructure.USART_Parity = USART_Parity_Odd;
            break;
        case MB_PAR_EVEN:
            USART_InitStructure.USART_Parity = USART_Parity_Even;
            break;
        default:
            eStatus = MB_EINVAL;
            break;
        }

        /* Setup flow control */
        USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;

        /* Enable transmit and receive */
        USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

        /* Default other settings. */
        USART_ClockInitStructure.USART_Clock = USART_Clock_Disable;
        USART_ClockInitStructure.USART_CPOL = USART_CPOL_Low;
        USART_ClockInitStructure.USART_CPHA = USART_CPHA_2Edge;
        USART_ClockInitStructure.USART_LastBit = USART_LastBit_Disable;

