hun9pham/ak-sources-base/STM32L151C8T6/sources/application/sources/platform/mbport/mbportserial.c
        if( eStatus != MB_EINVAL )
        {
            switch ( ucPort )
            {
#if UART_1_ENABLED == 1
            case UART_1_PORT:
                if( IDX_INVALID == xSerialHdls[UART_1_IDX].ubIdx )
                {
                    /* Configure  USART1 */
                    USART_Init( USART1, &USART_InitStructure );
                    USART_ClockInit(USART1, &USART_ClockInitStructure);
                    /* Enable the USART1 */
                    USART_Cmd( USART1, ENABLE );
                    /* Disable receive and transmit interrupts from the beginning */
                    USART_ITConfig( USART1, USART_IT_RXNE, DISABLE );
                    USART_ITConfig( USART1, USART_IT_TXE, DISABLE );

                    /* Setup handle to uart */
                    *pxSerialHdl = &xSerialHdls[UART_1_IDX];
                    xSerialHdls[UART_1_IDX].ubIdx = UART_1_IDX;
                    xSerialHdls[UART_1_IDX].xMBMHdl = xMBMHdl;

                    /* Everything is ok */
                    eStatus = MB_ENOERR;
                }
                else
                {
                    eStatus = MB_ENORES;
                }
                break;
#endif
#if UART_2_ENABLED == 1
            case UART_2_PORT:
                if( IDX_INVALID == xSerialHdls[UART_2_IDX].ubIdx )
                {
                    /* Configure STM32 USART2 */
                    USART_Init( USART2, &USART_InitStructure );
                    USART_ClockInit(USART2, &USART_ClockInitStructure);
                    /* Enable the USART2 */
                    USART_Cmd( USART2, ENABLE );

                    /* Disable receive and transmit interrupts from the beginning */
                    USART_ITConfig( USART2, USART_IT_RXNE, DISABLE );
                    USART_ITConfig( USART2, USART_IT_TXE, DISABLE );

                    /* Setup handle to uart */
                    *pxSerialHdl = &xSerialHdls[UART_2_IDX];
                    xSerialHdls[UART_2_IDX].ubIdx = UART_2_IDX;
                    xSerialHdls[UART_2_IDX].xMBMHdl = xMBMHdl;

                    /* Every thing is ok */
                    eStatus = MB_ENOERR;
                }
                else
                {
                    eStatus = MB_ENORES;
                }
                break;
#endif
#if UART_3_ENABLED == 1
            case UART_3_PORT:
                if( IDX_INVALID == xSerialHdls[UART_3_IDX].ubIdx )
                {
                    /* Configure  USART3 */
                    USART_Init( USART3, &USART_InitStructure );
                    USART_ClockInit(USART3, &USART_ClockInitStructure);
                    
                    /* Enable the USART3 */
                    USART_Cmd( USART3, ENABLE );

                    /* Disable receive and transmit interrupts from the beginning */
                    USART_ITConfig( USART3, USART_IT_RXNE, DISABLE );
                    USART_ITConfig( USART3, USART_IT_TXE, DISABLE );

                    /* Setup handle to uart */
                    *pxSerialHdl = &xSerialHdls[UART_3_IDX];
                    xSerialHdls[UART_3_IDX].ubIdx = UART_3_IDX;
                    xSerialHdls[UART_3_IDX].xMBMHdl = xMBMHdl;

                    /* Everything is ok */
                    eStatus = MB_ENOERR;
                }
                else
                {
                    eStatus = MB_ENORES;
                }
                break;
#endif
#if UART_4_ENABLED == 1
            case UART_4_PORT:
                if( IDX_INVALID == xSerialHdls[UART_4_PORT].ubIdx )
                {
                    /* Configure  USART4 */
                    USART_Init( USART4, &USART_InitStructure );
                    USART_ClockInit(USART4, &USART_ClockInitStructure);
                    /* Enable the USART4 */
                    USART_Cmd( USART4, ENABLE );
                    /* Disable receive and transmit interrupts from the beginning */
                    USART_ITConfig( USART4, USART_IT_RXNE, DISABLE );
                    USART_ITConfig( USART4, USART_IT_TXE, DISABLE );

                    /* Setup handle to uart */
                    *pxSerialHdl = &xSerialHdls[UART_4_PORT];
                    xSerialHdls[UART_4_PORT].ubIdx = UART_4_PORT;
                    xSerialHdls[UART_4_PORT].xMBMHdl = xMBMHdl;

                    /* Everything is ok */
                    eStatus = MB_ENOERR;
                }
                else
                {
                    eStatus = MB_ENORES;
                }
                break;
#endif
            default:
                break;
            }
        }
    }
    MBP_EXIT_CRITICAL_SECTION(  );
    return eStatus;
}

eMBErrorCode
eMBPSerialClose( xMBPSerialHandle xSerialHdl )
{
    eMBErrorCode    eStatus = MB_EINVAL;
    xSerialHandle  *pxSerialIntHdl = xSerialHdl;

    MBP_ENTER_CRITICAL_SECTION(  );
    if( MB_IS_VALID_HDL( pxSerialIntHdl, xSerialHdls ) )
    {
        switch ( pxSerialIntHdl->ubIdx )
        {
#if UART_1_ENABLED == 1
        case UART_1_IDX:
            if( ( NULL == pxSerialIntHdl->pbMBMTransmitterEmptyFN ) && ( NULL == pxSerialIntHdl->pvMBMReceiveFN ) )
            {
                /* Close USART 1 */
                USART_Cmd( USART1, DISABLE );
                USART_DeInit( USART1 );
                /* Force RS485 back to receive mode */
                RS_485_UART_1_DISABLE_TX(  );
                /* Reset handle */
                HDL_RESET( pxSerialIntHdl );
                /* No error */
                eStatus = MB_ENOERR;
            }
            else
            {
                eStatus = MB_EIO;
            }
            break;
#endif
#if UART_2_ENABLED == 1
        case UART_2_IDX:
            if( ( NULL == pxSerialIntHdl->pbMBMTransmitterEmptyFN ) && ( NULL == pxSerialIntHdl->pvMBMReceiveFN ) )
            {
                /* Close USART 1 */
                USART_Cmd( USART2, DISABLE );
                USART_DeInit( USART2 );
                /* Force RS485 back to receive mode */
                RS_485_UART_2_DISABLE_TX(  );
                /* Reset handle */
                HDL_RESET( pxSerialIntHdl );
                /* No error */
                eStatus = MB_ENOERR;
            }
            else
            {
                eStatus = MB_EIO;
            }
            break;
#endif
#if UART_3_ENABLED == 1
        case UART_3_IDX:
            if( ( NULL == pxSerialIntHdl->pbMBMTransmitterEmptyFN ) && ( NULL == pxSerialIntHdl->pvMBMReceiveFN ) )
            {
                /* Close USART 3 */
                USART_Cmd( USART3, DISABLE );
                USART_DeInit( USART3 );
                /* Force RS485 back to receive mode */
                RS_485_UART_3_DISABLE_TX(  );
                /* Reset handle */
                HDL_RESET( pxSerialIntHdl );
                /* No error */
                eStatus = MB_ENOERR;
            }
            else
            {
                eStatus = MB_EIO;
            }
            break;
#endif
#if UART_4_ENABLED == 1
        case UART_4_IDX:
            if( ( NULL == pxSerialIntHdl->pbMBMTransmitterEmptyFN ) && ( NULL == pxSerialIntHdl->pvMBMReceiveFN ) )
            {
                /* Close USART 4 */
                USART_Cmd( USART4, DISABLE );
                USART_DeInit( USART4 );
                /* Force RS485 back to receive mode */
                RS_485_UART_4_DISABLE_TX(  );
                /* Reset handle */
                HDL_RESET( pxSerialIntHdl );
                /* No error */
                eStatus = MB_ENOERR;
            }
            else
            {
                eStatus = MB_EIO;
            }
            break;
#endif
        default:
            MBP_ASSERT( 0 );
            break;
        }
    }
    MBP_EXIT_CRITICAL_SECTION(  );
    return eStatus;
}

eMBErrorCode
eMBPSerialTxEnable( xMBPSerialHandle xSerialHdl, pbMBPSerialTransmitterEmptyCB pbMBMTransmitterEmptyFN )
{
    eMBErrorCode    eStatus = MB_EINVAL;
    xSerialHandle  *pxSerialIntHdl = xSerialHdl;

    MBP_ENTER_CRITICAL_SECTION(  );
    if( MB_IS_VALID_HDL( pxSerialIntHdl, xSerialHdls ) )
    {
        eStatus = MB_ENOERR;
        if( NULL != pbMBMTransmitterEmptyFN )
        {
            MBP_ASSERT( NULL == pxSerialIntHdl->pbMBMTransmitterEmptyFN );
            pxSerialIntHdl->pbMBMTransmitterEmptyFN = pbMBMTransmitterEmptyFN;
            switch ( pxSerialIntHdl->ubIdx )
            {
#if UART_1_ENABLED == 1
            case UART_1_IDX:
                /* RS485 transmit mode */
                RS_485_UART_1_ENABLE_TX(  );
                /* Enable USART 1 tx interrupt */
                USART_ITConfig( USART1, USART_IT_TXE, ENABLE );
                break;
#endif
#if UART_2_ENABLED == 1
            case UART_2_IDX:
                /* RS485 transmit mode */
                RS_485_UART_2_ENABLE_TX(  );
                /* Enable USART 2 tx interrupt */
                USART_ITConfig( USART2, USART_IT_TXE, ENABLE );
                break;
#endif
#if UART_3_ENABLED == 1
            case UART_3_IDX:
                /* RS485 transmit mode */
                RS_485_UART_3_ENABLE_TX(  );
                /* Enable USART 3 tx interrupt */
                USART_ITConfig( USART3, USART_IT_TXE, ENABLE );
                break;
#endif
#if UART_4_ENABLED == 1
            case UART_4_IDX:
                /* RS485 transmit mode */
                RS_485_UART_4_ENABLE_TX(  );
                /* Enable USART 4 tx interrupt */
                USART_ITConfig( USART4, USART_IT_TXE, ENABLE );
                break;
#endif
            default:
                MBP_ASSERT( 0 );
            }

