hun9pham/ak-sources-base/STM32L151C8T6/sources/application/sources/platform/mbport/mbportserial.c
        }
        else
        {
            pxSerialIntHdl->pbMBMTransmitterEmptyFN = NULL;
            /* The transmitter is disable when the last frame has been sent.
             * This is necessary for RS485 with a half-duplex bus.
             */
            switch ( pxSerialIntHdl->ubIdx )
            {
#if UART_1_ENABLED == 1
            case UART_1_IDX:
                /* Disable transmit register empty interrupt */
                USART_ITConfig( USART1, USART_IT_TXE, DISABLE );
                /* Enable transmit complete interrupt */
                USART_ITConfig( USART1, USART_IT_TC, ENABLE );
                break;
#endif
#if UART_2_ENABLED == 1
            case UART_2_IDX:
                /* Disable transmit register empty interrupt */
                USART_ITConfig( USART2, USART_IT_TXE, DISABLE );
                /* Enable transmit complete interrupt */
                USART_ITConfig( USART2, USART_IT_TC, ENABLE );
                break;
#endif
#if UART_3_ENABLED == 1
            case UART_3_IDX:
                /* Disable transmit register empty interrupt */
                USART_ITConfig( USART3, USART_IT_TXE, DISABLE );
                /* Enable transmit complete interrupt */
                USART_ITConfig( USART3, USART_IT_TC, ENABLE );
                break;
#endif
#if UART_4_ENABLED == 1
            case UART_4_IDX:
                /* Disable transmit register empty interrupt */
                USART_ITConfig( USART4, USART_IT_TXE, DISABLE );
                /* Enable transmit complete interrupt */
                USART_ITConfig( USART4, USART_IT_TC, ENABLE );
                break;
#endif
            default:
                MBP_ASSERT( 0 );
            }
        }
    }
    MBP_EXIT_CRITICAL_SECTION(  );
    return eStatus;
}

eMBErrorCode
eMBPSerialRxEnable( xMBPSerialHandle xSerialHdl, pvMBPSerialReceiverCB pvMBMReceiveFN )
{
    eMBErrorCode    eStatus = MB_EINVAL;
    xSerialHandle  *pxSerialIntHdl = xSerialHdl;

    MBP_ENTER_CRITICAL_SECTION(  );
    if( MB_IS_VALID_HDL( pxSerialIntHdl, xSerialHdls ) )
    {
        eStatus = MB_ENOERR;
        if( NULL != pvMBMReceiveFN )
        {
            MBP_ASSERT( NULL == pxSerialIntHdl->pvMBMReceiveFN );
            pxSerialIntHdl->pvMBMReceiveFN = pvMBMReceiveFN;
            switch ( pxSerialIntHdl->ubIdx )
            {
#if UART_1_ENABLED == 1
            case UART_1_IDX:
                /* Enable USART 1 receive interrupt */
                USART_ITConfig( USART1, USART_IT_RXNE, ENABLE );
                break;
#endif
#if UART_2_ENABLED == 1
            case UART_2_IDX:
                /* Enable USART 2 receive interrupt */
                USART_ITConfig( USART2, USART_IT_RXNE, ENABLE );
                break;
#endif
#if UART_3_ENABLED == 1
            case UART_3_IDX:
                /* Enable USART 3 receive interrupt */
                USART_ITConfig( USART3, USART_IT_RXNE, ENABLE );
                break;
#endif
#if UART_4_ENABLED == 1
            case UART_4_IDX:
                /* Enable USART 1 receive interrupt */
                USART_ITConfig( USART4, USART_IT_RXNE, ENABLE );
                break;
#endif
            default:
                MBP_ASSERT( 0 );
            }
        }
        else
        {
            pxSerialIntHdl->pvMBMReceiveFN = NULL;
            switch ( pxSerialIntHdl->ubIdx )
            {
#if UART_1_ENABLED == 1
            case UART_1_IDX:
                /* Disable USART 1 receive interrupt */
                USART_ITConfig( USART1, USART_IT_RXNE, DISABLE );
                break;
#endif
#if UART_2_ENABLED == 1
            case UART_2_IDX:
                /* Disable USART 2 receive interrupt */
                USART_ITConfig( USART2, USART_IT_RXNE, DISABLE );
                break;
#endif
#if UART_3_ENABLED == 1
            case UART_3_IDX:
                /* Disable USART 3 receive interrupt */
                USART_ITConfig( USART3, USART_IT_RXNE, DISABLE );
                break;
#endif
#if UART_4_ENABLED == 1
            case UART_4_IDX:
                /* Disable USART 4 receive interrupt */
                USART_ITConfig( USART4, USART_IT_RXNE, DISABLE );
                break;
#endif
            default:
                MBP_ASSERT( 0 );
            }
        }
    }
    MBP_EXIT_CRITICAL_SECTION(  );
    return eStatus;
}

#if UART_1_ENABLED == 1
void
vMBPUSART1ISR( void )
{
    /* Check for receive interrupt */
    if( USART_GetITStatus( USART1, USART_IT_RXNE ) != RESET )
    {
        /* Handle data incomming data in modbus functions. Interrupt flag is 
         * cleared when byte is read in receive register.
         */
        prvvMBPUSART1_RXNE_ISR(  );
    }
    /* Check for transmit interrupt */
    if( USART_GetITStatus( USART1, USART_IT_TXE ) != RESET )
    {
        /* Handle transmission of data in modbus functions. Interrupt flags are
         * cleared when new byte is written to transmit register.
         */
        prvvMBPUSART1_TXE_ISR(  );
    }
    /* Check for transmit complete */
    if( USART_GetITStatus( USART1, USART_IT_TC ) != RESET )
    {
        /* Handle transmit complete in modbus library */
        prvvMBPUSART1_TC_ISR(  );
    }
}

void
prvvMBPUSART1_TXE_ISR( void )
{
    MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_1_IDX].ubIdx );
    BOOL            bHasMoreData = TRUE;
    UBYTE           ubTxByte;

    if( NULL != xSerialHdls[UART_1_IDX].pbMBMTransmitterEmptyFN )
    {
        bHasMoreData = xSerialHdls[UART_1_IDX].pbMBMTransmitterEmptyFN( xSerialHdls[UART_1_IDX].xMBMHdl, &ubTxByte );
    }
    if( !bHasMoreData )
    {
        xSerialHdls[UART_1_IDX].pbMBMTransmitterEmptyFN = NULL;
        /* The transmitter is disabled when the last frame has been sent.
         * This is necessary for RS485 with a hald-duplex bus.
         */
        USART_ITConfig( USART1, USART_IT_TXE, DISABLE );
        USART_ITConfig( USART1, USART_IT_TC, ENABLE );
    }
    else
    {
        /* Transmit byte on USART */
        USART_SendData( USART1, ubTxByte );
    }
}

/* USART 1 Transmit Complete interrupt */
void
prvvMBPUSART1_TC_ISR( void )
{
    /* Back to receive mode */
    RS_485_UART_1_DISABLE_TX(  );
    /* Transmission complete. Disable interrupt */
    USART_ITConfig( USART1, USART_IT_TC, DISABLE );
}

