hun9pham/ak-sources-base/STM32L151C8T6/sources/application/sources/platform/mbport/mbportserial.c
/* USART 1 Receive interrupt */
void
prvvMBPUSART1_RXNE_ISR( void )
{
    UBYTE           ubUDR;
    FlagStatus      fs;

    /* Read current flagstatus */
    fs = RESET;
    if( USART_GetFlagStatus( USART1, USART_FLAG_ORE ) )
    {
        fs |= 1;
    }
    if( USART_GetFlagStatus( USART1, USART_FLAG_NE ) )
    {
        fs |= 2;
    }
    if( USART_GetFlagStatus( USART1, USART_FLAG_FE ) )
    {
        fs |= 4;
    }
    if( USART_GetFlagStatus( USART1, USART_FLAG_PE ) )
    {
        fs |= 8;
    }

    /* Receive byte from USART1 */
    ubUDR = USART_ReceiveData( USART1 );

    /* Send data to modbus functions
     * if no error */
    if( fs == RESET )
    {
        /* Pass received data on to modbuslib */
        MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_1_IDX].ubIdx );
        if( NULL != xSerialHdls[UART_1_IDX].pvMBMReceiveFN )
        {
            xSerialHdls[UART_1_IDX].pvMBMReceiveFN( xSerialHdls[UART_1_IDX].xMBMHdl, ubUDR );
        }
    }
}

#endif

#if UART_2_ENABLED == 1
void
vMBPUSART2ISR( void )
{
    /* Check for receive interrupt */
    if( USART_GetITStatus( USART2, USART_IT_RXNE ) != RESET )
    {
        /* Handle data incomming data in modbus functions. Interrupt flag is 
         * cleared when byte is read in receive register.
         */
        prvvMBPUSART2_RXNE_ISR(  );
    }
    /* Check for transmit interrupt */
    if( USART_GetITStatus( USART2, USART_IT_TXE ) != RESET )
    {
        /* Handle transmission of data in modbus functions. Interrupt flags are
         * cleared when new byte is written to transmit register.
         */
        prvvMBPUSART2_TXE_ISR(  );
    }
    /* Check for transmit complete */
    if( USART_GetITStatus( USART2, USART_IT_TC ) != RESET )
    {
        /* Handle transmit complete in modbus library */
        prvvMBPUSART2_TC_ISR(  );
    }
}

/* USART 2 transmit register empty interrupt */
void
prvvMBPUSART2_TXE_ISR( void )
{
    MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_2_IDX].ubIdx );
    BOOL            bHasMoreData = TRUE;
    UBYTE           ubTxByte;

    if( NULL != xSerialHdls[UART_2_IDX].pbMBMTransmitterEmptyFN )
    {
        bHasMoreData = xSerialHdls[UART_2_IDX].pbMBMTransmitterEmptyFN( xSerialHdls[UART_2_IDX].xMBMHdl, &ubTxByte );
    }
    if( !bHasMoreData )
    {
        xSerialHdls[UART_2_IDX].pbMBMTransmitterEmptyFN = NULL;
        /* The transmitter is disabled when the last frame has been sent.
         * This is necessary for RS485 with a hald-duplex bus.
         */
        USART_ITConfig( USART2, USART_IT_TXE, DISABLE );
        USART_ITConfig( USART2, USART_IT_TC, ENABLE );
    }
    else
    {
        /* Transmit byte on USART 2 */
        USART_SendData( USART2, ubTxByte );
    }
}

/* USART 2 Transmit Complete interrupt */
void
prvvMBPUSART2_TC_ISR( void )
{
    /* Back to receive mode */
    RS_485_UART_2_DISABLE_TX(  );
    /* Disable TC interrupt */
    USART_ITConfig( USART2, USART_IT_TC, DISABLE );
}

/* USART 2 reveive interrupt */
void
prvvMBPUSART2_RXNE_ISR( void )
{
    UBYTE           ubUDR;
    FlagStatus      fs;

    /* Read current flagstatus */
    fs = RESET;
    if( USART_GetFlagStatus( USART2, USART_FLAG_ORE ) )
        fs |= 1;
    if( USART_GetFlagStatus( USART2, USART_FLAG_NE ) )
        fs |= 2;
    if( USART_GetFlagStatus( USART2, USART_FLAG_FE ) )
        fs |= 4;
    if( USART_GetFlagStatus( USART2, USART_FLAG_PE ) )
        fs |= 8;

    /* Read byte from USART */
    ubUDR = USART_ReceiveData( USART2 );

    /* Send data to modbus functions
     * if no error */
    if( fs == RESET )
    {
        MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_2_IDX].ubIdx );
        if( NULL != xSerialHdls[UART_2_IDX].pvMBMReceiveFN )
        {
            xSerialHdls[UART_2_IDX].pvMBMReceiveFN( xSerialHdls[UART_2_IDX].xMBMHdl, ubUDR );
        }
    }
}
#endif

#if UART_3_ENABLED == 1
void
vMBPUSART3ISR( void )
{
    /* Check for receive interrupt */
    if( USART_GetITStatus( USART3, USART_IT_RXNE ) != RESET )
    {
        /* Handle data incomming data in modbus functions. Interrupt flag is 
         * cleared when byte is read in receive register.
         */
        prvvMBPUSART3_RXNE_ISR(  );
    }
    /* Check for transmit interrupt */
    if( USART_GetITStatus( USART3, USART_IT_TXE ) != RESET )
    {
        /* Handle transmission of data in modbus functions. Interrupt flags are
         * cleared when new byte is written to transmit register.
         */
        prvvMBPUSART3_TXE_ISR(  );
    }
    /* Check for transmit complete */
    if( USART_GetITStatus( USART3, USART_IT_TC ) != RESET )
    {
        /* Handle transmit complete in modbus library */
        prvvMBPUSART3_TC_ISR(  );
    }
}

void
prvvMBPUSART3_TXE_ISR( void )
{
    MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_3_IDX].ubIdx );
    BOOL            bHasMoreData = TRUE;
    UBYTE           ubTxByte;

    if( NULL != xSerialHdls[UART_3_IDX].pbMBMTransmitterEmptyFN )
    {
        bHasMoreData = xSerialHdls[UART_3_IDX].pbMBMTransmitterEmptyFN( xSerialHdls[UART_3_IDX].xMBMHdl, &ubTxByte );
    }
    if( !bHasMoreData )
    {
        xSerialHdls[UART_3_IDX].pbMBMTransmitterEmptyFN = NULL;
        /* The transmitter is disabled when the last frame has been sent.
         * This is necessary for RS485 with a hald-duplex bus.
         */
        USART_ITConfig( USART3, USART_IT_TXE, DISABLE );
        USART_ITConfig( USART3, USART_IT_TC, ENABLE );
    }
    else
    {
        /* Transmit byte on USART */
        USART_SendData( USART3, ubTxByte );
    }
}

/* USART 3 Transmit Complete interrupt */
void
prvvMBPUSART3_TC_ISR( void )
{
    /* Back to receive mode */
    RS_485_UART_3_DISABLE_TX(  );
    /* Transmission complete. Disable interrupt */
    USART_ITConfig( USART3, USART_IT_TC, DISABLE );
}

/* USART 3 Receive interrupt */
void
prvvMBPUSART3_RXNE_ISR( void )
{
    UBYTE           ubUDR;
    FlagStatus      fs;

    /* Read current flagstatus */
    fs = RESET;
    if( USART_GetFlagStatus( USART3, USART_FLAG_ORE ) )
    {
        fs |= 1;
    }
    if( USART_GetFlagStatus( USART3, USART_FLAG_NE ) )
    {
        fs |= 2;
    }
    if( USART_GetFlagStatus( USART3, USART_FLAG_FE ) )
    {
        fs |= 4;
    }
    if( USART_GetFlagStatus( USART3, USART_FLAG_PE ) )
    {
        fs |= 8;
    }

