hun9pham/ak-sources-base/STM32L151C8T6/sources/application/sources/platform/mbport/mbportserial.c
    /* Receive byte from USART3 */
    ubUDR = USART_ReceiveData( USART3 );

    /* Send data to modbus functions
     * if no error */
    if( fs == RESET )
    {
        /* Pass received data on to modbuslib */
        MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_3_IDX].ubIdx );
        if( NULL != xSerialHdls[UART_3_IDX].pvMBMReceiveFN )
        {
            xSerialHdls[UART_3_IDX].pvMBMReceiveFN( xSerialHdls[UART_3_IDX].xMBMHdl, ubUDR );
        }
    }
}

#endif


#if UART_4_ENABLED == 1
void
vMBPUSART4ISR( void )
{
    /* Check for receive interrupt */
    if( USART_GetITStatus( USART4, USART_IT_RXNE ) != RESET )
    {
        /* Handle data incomming data in modbus functions. Interrupt flag is 
         * cleared when byte is read in receive register.
         */
        prvvMBPUSART4_RXNE_ISR(  );
    }
    /* Check for transmit interrupt */
    if( USART_GetITStatus( USART4, USART_IT_TXE ) != RESET )
    {
        /* Handle transmission of data in modbus functions. Interrupt flags are
         * cleared when new byte is written to transmit register.
         */
        prvvMBPUSART4_TXE_ISR(  );
    }
    /* Check for transmit complete */
    if( USART_GetITStatus( USART4, USART_IT_TC ) != RESET )
    {
        /* Handle transmit complete in modbus library */
        prvvMBPUSART4_TC_ISR(  );
    }
}

void
prvvMBPUSART4_TXE_ISR( void )
{
    MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_4_IDX].ubIdx );
    BOOL            bHasMoreData = TRUE;
    UBYTE           ubTxByte;

    if( NULL != xSerialHdls[UART_4_IDX].pbMBMTransmitterEmptyFN )
    {
        bHasMoreData = xSerialHdls[UART_4_IDX].pbMBMTransmitterEmptyFN( xSerialHdls[UART_4_IDX].xMBMHdl, &ubTxByte );
    }
    if( !bHasMoreData )
    {
        xSerialHdls[UART_4_IDX].pbMBMTransmitterEmptyFN = NULL;
        /* The transmitter is disabled when the last frame has been sent.
         * This is necessary for RS485 with a hald-duplex bus.
         */
        USART_ITConfig( USART4, USART_IT_TXE, DISABLE );
        USART_ITConfig( USART4, USART_IT_TC, ENABLE );
    }
    else
    {
        /* Transmit byte on USART */
        USART_SendData( USART4, ubTxByte );
    }
}

/* USART 4 Transmit Complete interrupt */
void
prvvMBPUSART4_TC_ISR( void )
{
    /* Back to receive mode */
    RS_485_UART_4_DISABLE_TX(  );
    /* Transmission complete. Disable interrupt */
    USART_ITConfig( USART4, USART_IT_TC, DISABLE );
}

/* USART 4 Receive interrupt */
void
prvvMBPUSART4_RXNE_ISR( void )
{
    UBYTE           ubUDR;
    FlagStatus      fs;

    /* Read current flagstatus */
    fs = RESET;
    if( USART_GetFlagStatus( USART4, USART_FLAG_ORE ) )
    {
        fs |= 1;
    }
    if( USART_GetFlagStatus( USART4, USART_FLAG_NE ) )
    {
        fs |= 2;
    }
    if( USART_GetFlagStatus( USART4, USART_FLAG_FE ) )
    {
        fs |= 4;
    }
    if( USART_GetFlagStatus( USART4, USART_FLAG_PE ) )
    {
        fs |= 8;
    }

    /* Receive byte from USART4 */
    ubUDR = USART_ReceiveData( USART4 );

    /* Send data to modbus functions
     * if no error */
    if( fs == RESET )
    {
        /* Pass received data on to modbuslib */
        MBP_ASSERT( IDX_INVALID != xSerialHdls[UART_4_IDX].ubIdx );
        if( NULL != xSerialHdls[UART_4_IDX].pvMBMReceiveFN )
        {
            xSerialHdls[UART_4_IDX].pvMBMReceiveFN( xSerialHdls[UART_4_IDX].xMBMHdl, ubUDR );
        }
    }
}

#endif


/*----------------------------------------------------------------------------*
 *  DECLARE: UART User include
 *  Note: csModbus protocol
 *----------------------------------------------------------------------------*/
void User_vMBPUSARTxISR(void) {
#if UART_1_ENABLED == 1
    vMBPUSART1ISR();
#endif


#if UART_2_ENABLED == 1
    vMBPUSART2ISR();
#endif


#if UART_3_ENABLED == 1
    vMBPUSART3ISR();
#endif


#if UART_4_ENABLED == 1
    vMBPUSART4ISR();
#endif
}
/*----------------------------------------------------------------------------*/